<?php
/* 산술 연산자 */
$a = 5 + 4;
echo $a;

$a = 5 - 4;
echo "<br>" . $a;

$a = 5 * 4;
echo "<br>" . $a;

$a = 5 / 4;
echo "<br>" . $a;

$a = 5 % 4; //나머지
echo "<br>" . $a;

$a = 2 ** 3; //제곱
echo "<br>" . $a;



/* 할당 연산자 */
$x = 10;
$y = 20;

$x += $y; // $x = $x + $y;
echo "<br>" . $x;
$x -= $y; // $x = $x - $y;
echo "<br>" . $x;
$x *= $y; // $x = $x * $y;
echo "<br>" . $x;
$x /= $y; // $x = $x / $y;
echo "<br>" . $x;
$x %= $y; // $x = $x % $y;
echo "<br>" . $x;


/* 비교 연산자 */
$a = 10;
$b = 10;

if($a == $b) { //같다
    echo "<br>a와 b는 같습니다.";
} else {
    echo "<br>a와 b는 다릅니다.";
} // ==, !=, <, >, <=, >=, ===(타입까지), !==(타입까지)


/* 증감 연산자 */
$a = 10;
$a++; //$a--
echo "<br>" . $a; //11

?>